Revit 2024 API
DistributionSysType.NumWires Property
 Get or set number of wires of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int NumWires { get; set; }
Visual Basic
Public Property NumWires As Integer
	Get
	Set
Visual C++
public:
property int NumWires {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException | While assign a negative value to NumWires.
See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace